In [4]:
#Object Creation

In [5]:
import numpy as np
import pandas as pd

In [6]:
s=pd.Series([1,2,4,5,np.nan,6,7])
s

0    1.0
1    2.0
2    4.0
3    5.0
4    NaN
5    6.0
6    7.0
dtype: float64

In [7]:
dates=pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.125168 -0.831498  2.185906 -0.009386
2013-01-02  1.692103  1.517894 -0.554996 -0.892630
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337
2013-01-04 -0.302956 -1.313270  0.014472  2.003685
2013-01-05 -0.778185  1.044696  2.199020 -0.761124
2013-01-06 -0.201096  0.226746 -0.725279  0.417864

In [9]:
df2=pd.DataFrame(
{
    "A":1.0,
    "B":pd.Timestamp("20130102"),
    "C":pd.Series(1, index=list(range(4)), dtype="float32"),
    "D":np.array([3]*4, dtype="int32"),
    "E":pd.Categorical(["test","train", "test", "train"]),
    "F":"foo"
})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
#It is a sunbset of attribute that will be completed

"""In [12]: df2.<TAB>  # noqa: E225, E999
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.columns
df2.align              df2.copy
df2.all                df2.count
df2.any                df2.combine
df2.append             df2.D
df2.apply              df2.describe
df2.applymap           df2.diff
df2.B                  df2.duplicated"""

'In [12]: df2.<TAB>  # noqa: E225, E999\ndf2.A                  df2.bool\ndf2.abs                df2.boxplot\ndf2.add                df2.C\ndf2.add_prefix         df2.clip\ndf2.add_suffix         df2.columns\ndf2.align              df2.copy\ndf2.all                df2.count\ndf2.any                df2.combine\ndf2.append             df2.D\ndf2.apply              df2.describe\ndf2.applymap           df2.diff\ndf2.B                  df2.duplicated'

In [12]:
#Viewing Data

In [13]:
df.head()

                   A         B         C         D
2013-01-01  0.125168 -0.831498  2.185906 -0.009386
2013-01-02  1.692103  1.517894 -0.554996 -0.892630
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337
2013-01-04 -0.302956 -1.313270  0.014472  2.003685
2013-01-05 -0.778185  1.044696  2.199020 -0.761124

In [14]:
df.tail()

                   A         B         C         D
2013-01-02  1.692103  1.517894 -0.554996 -0.892630
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337
2013-01-04 -0.302956 -1.313270  0.014472  2.003685
2013-01-05 -0.778185  1.044696  2.199020 -0.761124
2013-01-06 -0.201096  0.226746 -0.725279  0.417864

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[ 0.12516763, -0.83149817,  2.18590611, -0.00938562],
       [ 1.69210296,  1.51789434, -0.5549957 , -0.89263025],
       [-0.74869635, -2.10237544, -0.95305115, -0.14433673],
       [-0.30295602, -1.31326976,  0.0144721 ,  2.00368494],
       [-0.77818495,  1.04469552,  2.1990197 , -0.76112438],
       [-0.20109585,  0.22674624, -0.72527887,  0.41786354]])

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [19]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.035610 -0.242968  0.361012  0.102345
std    0.913193  1.409160  1.454267  1.051051
min   -0.778185 -2.102375 -0.953051 -0.892630
25%   -0.637261 -1.192827 -0.682708 -0.606927
50%   -0.252026 -0.302376 -0.270262 -0.076861
75%    0.043602  0.840208  1.643048  0.311051
max    1.692103  1.517894  2.199020  2.003685

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.125168    1.692103   -0.748696   -0.302956   -0.778185   -0.201096
B   -0.831498    1.517894   -2.102375   -1.313270    1.044696    0.226746
C    2.185906   -0.554996   -0.953051    0.014472    2.199020   -0.725279
D   -0.009386   -0.892630   -0.144337    2.003685   -0.761124    0.417864

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.009386  2.185906 -0.831498  0.125168
2013-01-02 -0.892630 -0.554996  1.517894  1.692103
2013-01-03 -0.144337 -0.953051 -2.102375 -0.748696
2013-01-04  2.003685  0.014472 -1.313270 -0.302956
2013-01-05 -0.761124  2.199020  1.044696 -0.778185
2013-01-06  0.417864 -0.725279  0.226746 -0.201096

In [23]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337
2013-01-04 -0.302956 -1.313270  0.014472  2.003685
2013-01-01  0.125168 -0.831498  2.185906 -0.009386
2013-01-06 -0.201096  0.226746 -0.725279  0.417864
2013-01-05 -0.778185  1.044696  2.199020 -0.761124
2013-01-02  1.692103  1.517894 -0.554996 -0.892630

In [24]:
#Selection

In [25]:
#Getitem []

In [26]:
df["A"]

2013-01-01    0.125168
2013-01-02    1.692103
2013-01-03   -0.748696
2013-01-04   -0.302956
2013-01-05   -0.778185
2013-01-06   -0.201096
Freq: D, Name: A, dtype: float64

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01  0.125168 -0.831498  2.185906 -0.009386
2013-01-02  1.692103  1.517894 -0.554996 -0.892630
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337

In [28]:
#Selection by levels

In [29]:
df.loc[dates[0]]

A    0.125168
B   -0.831498
C    2.185906
D   -0.009386
Name: 2013-01-01 00:00:00, dtype: float64

In [30]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.125168 -0.831498
2013-01-02  1.692103  1.517894
2013-01-03 -0.748696 -2.102375
2013-01-04 -0.302956 -1.313270
2013-01-05 -0.778185  1.044696
2013-01-06 -0.201096  0.226746

In [31]:
df.loc["20130102":"20130104",["A", "B"]]

                   A         B
2013-01-02  1.692103  1.517894
2013-01-03 -0.748696 -2.102375
2013-01-04 -0.302956 -1.313270

In [32]:
df.loc[dates[0],"A"]

0.12516762893019165

In [33]:
df.at[dates[0],"A"]

0.12516762893019165

In [34]:
#Selection by position

In [35]:
df.iloc[3]

A   -0.302956
B   -1.313270
C    0.014472
D    2.003685
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.302956 -1.313270
2013-01-05 -0.778185  1.044696

In [37]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.692103 -0.554996
2013-01-03 -0.748696 -0.953051
2013-01-05 -0.778185  2.199020

In [38]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.692103  1.517894 -0.554996 -0.892630
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337

In [39]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.831498  2.185906
2013-01-02  1.517894 -0.554996
2013-01-03 -2.102375 -0.953051
2013-01-04 -1.313270  0.014472
2013-01-05  1.044696  2.199020
2013-01-06  0.226746 -0.725279

In [40]:
df.iloc[1,1]

1.5178943444550907

In [41]:
df.iat[1,1]

1.5178943444550907

In [42]:
#Boolen Indexing

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01  0.125168       NaN  2.185906       NaN
2013-01-02  1.692103  1.517894       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN       NaN  0.014472  2.003685
2013-01-05       NaN  1.044696  2.199020       NaN
2013-01-06       NaN  0.226746       NaN  0.417864

In [44]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.125168 -0.831498  2.185906 -0.009386
2013-01-02  1.692103  1.517894 -0.554996 -0.892630

In [45]:
df2=df.copy()
df2["E"]=["One","One", "Two", "Three", "Four", "Three"]
df2

                   A         B         C         D      E
2013-01-01  0.125168 -0.831498  2.185906 -0.009386    One
2013-01-02  1.692103  1.517894 -0.554996 -0.892630    One
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337    Two
2013-01-04 -0.302956 -1.313270  0.014472  2.003685  Three
2013-01-05 -0.778185  1.044696  2.199020 -0.761124   Four
2013-01-06 -0.201096  0.226746 -0.725279  0.417864  Three

In [46]:
df2[df2["E"].isin(["Two","Four"])]

                   A         B         C         D     E
2013-01-03 -0.748696 -2.102375 -0.953051 -0.144337   Two
2013-01-05 -0.778185  1.044696  2.199020 -0.761124  Four

In [47]:
#Setting

In [48]:
s1=pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [49]:
df.at[dates[0], "A"]=0

In [50]:
df.iat[0, 1]=0

In [51]:
df.loc[:, "D"]=np.array([5]* len(df))

In [52]:
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  2.185906  5.0
2013-01-02  1.692103  1.517894 -0.554996  5.0
2013-01-03 -0.748696 -2.102375 -0.953051  5.0
2013-01-04 -0.302956 -1.313270  0.014472  5.0
2013-01-05 -0.778185  1.044696  2.199020  5.0
2013-01-06 -0.201096  0.226746 -0.725279  5.0

In [53]:
df2=df.copy()

df2[df2 > 0]= -df2

df2

                   A         B         C    D
2013-01-01  0.000000  0.000000 -2.185906 -5.0
2013-01-02 -1.692103 -1.517894 -0.554996 -5.0
2013-01-03 -0.748696 -2.102375 -0.953051 -5.0
2013-01-04 -0.302956 -1.313270 -0.014472 -5.0
2013-01-05 -0.778185 -1.044696 -2.199020 -5.0
2013-01-06 -0.201096 -0.226746 -0.725279 -5.0

In [54]:
#Missing date

In [55]:
In [55]: df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [56]: df1.loc[dates[0] : dates[1], "E"] = 1

In [57]: df1
Out[57]: 
                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.509059  5.0  NaN  1.0
2013-01-02  1.212112 -0.173215  0.119209  5.0  1.0  1.0
2013-01-03 -0.861849 -2.104569 -0.494929  5.0  2.0  NaN
2013-01-04  0.721555 -0.706771 -1.039575  5.0  3.0  NaN

SyntaxError: leading zeros in decimal integer literals are not permitted; use an 0o prefix for octal integers (3640402569.py, line 8)

In [56]:
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0]: dates[1], "E"]=1

df1

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  2.185906  5.0  1.0
2013-01-02  1.692103  1.517894 -0.554996  5.0  1.0
2013-01-03 -0.748696 -2.102375 -0.953051  5.0  NaN
2013-01-04 -0.302956 -1.313270  0.014472  5.0  NaN

In [57]:
df1.dropna(how= "any")

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  2.185906  5.0  1.0
2013-01-02  1.692103  1.517894 -0.554996  5.0  1.0

In [58]:
df1.fillna(value=5)

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  2.185906  5.0  1.0
2013-01-02  1.692103  1.517894 -0.554996  5.0  1.0
2013-01-03 -0.748696 -2.102375 -0.953051  5.0  5.0
2013-01-04 -0.302956 -1.313270  0.014472  5.0  5.0

In [59]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [60]:
#operations

In [61]:
#stats

In [62]:
df.mean()

A   -0.056472
B   -0.104385
C    0.361012
D    5.000000
dtype: float64

In [63]:
df.mean(axis=1)

2013-01-01    1.796477
2013-01-02    1.913750
2013-01-03    0.298969
2013-01-04    0.849562
2013-01-05    1.866383
2013-01-06    1.075093
Freq: D, dtype: float64

In [64]:
s=pd.Series([1,3,5, np.nan, 6,8], index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [65]:
df.sub(s, axis="index")

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.748696 -3.102375 -1.953051  4.0
2013-01-04 -3.302956 -4.313270 -2.985528  2.0
2013-01-05 -5.778185 -3.955304 -2.800980  0.0
2013-01-06       NaN       NaN       NaN  NaN

In [66]:
#User Defined Function

In [67]:
df.agg(lambda x:np.mean(x)*5.6)

A    -0.316242
B    -0.584555
C     2.021667
D    28.000000
dtype: float64

In [68]:
df.transform(lambda x:x*101.2)

                     A           B           C      D
2013-01-01    0.000000    0.000000  221.213699  506.0
2013-01-02  171.240819  153.610908  -56.165564  506.0
2013-01-03  -75.768070 -212.760394  -96.448776  506.0
2013-01-04  -30.659149 -132.902899    1.464577  506.0
2013-01-05  -78.752317  105.723187  222.540794  506.0
2013-01-06  -20.350900   22.946719  -73.398221  506.0

In [69]:
#Value counts

In [70]:
s=pd.Series(np.random.randint(0,7, size=10))
s

0    2
1    1
2    4
3    1
4    5
5    6
6    0
7    5
8    2
9    2
dtype: int32

In [71]:
s.value_counts()

2    3
1    2
5    2
4    1
6    1
0    1
Name: count, dtype: int64

In [72]:
#String methods

In [73]:
s=pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA","dog", "cat"])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [74]:
#merge

In [75]:
#Concat

In [76]:
df=pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.079142  1.220030  1.256996 -0.144880
1 -0.313951 -0.191460 -0.123366 -0.166785
2 -1.163476  1.128462  0.259592  1.094458
3  0.366908  0.335583 -0.572230  0.850390
4 -0.729763  1.457923 -0.706809 -0.676232
5 -1.645297 -0.716974  1.775474  0.287146
6  1.180995 -0.709715 -0.305053 -0.111252
7  0.419025  0.250235  0.619524 -0.099634
8  0.951043 -0.044546  1.897708  0.634642
9 -1.320200  0.558409  0.620511 -0.507749

In [77]:
pieces=[df[:3], df[3:7], df[7:1]]
pd.concat(pieces)

          0         1         2         3
0 -0.079142  1.220030  1.256996 -0.144880
1 -0.313951 -0.191460 -0.123366 -0.166785
2 -1.163476  1.128462  0.259592  1.094458
3  0.366908  0.335583 -0.572230  0.850390
4 -0.729763  1.457923 -0.706809 -0.676232
5 -1.645297 -0.716974  1.775474  0.287146
6  1.180995 -0.709715 -0.305053 -0.111252

In [78]:
#join

In [79]:
left=pd.DataFrame({"key": ["foo", "foo"], "lval":[1,2]})

right=pd.DataFrame({"key": ["foo", "foo"], "rval":[4,5]})

In [80]:
left

   key  lval
0  foo     1
1  foo     2

In [81]:
right

   key  rval
0  foo     4
1  foo     5

In [82]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [83]:
#Grouping

In [84]:
df=pd.DataFrame(
{
    "A":["foo", "bar", "foo", "bar", "foo","bar", "foo", "foo"],
    "B":["one", "one", "two", "three", "two", "two", "one", "three"],
    "C":np.random.randn(8),
    "D":np.random.randn(8),
})

df

     A      B         C         D
0  foo    one  0.633707  0.370108
1  bar    one  0.606134 -1.179491
2  foo    two -1.248358  0.699939
3  bar  three -1.921104 -0.095122
4  foo    two -0.632653 -0.660990
5  bar    two  1.227300 -0.933870
6  foo    one  0.806044 -0.156980
7  foo  three  2.028818  0.149617

In [87]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar -0.087670 -2.208483
foo  1.587558  0.401694

In [88]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.606134 -1.179491
    three -1.921104 -0.095122
    two    1.227300 -0.933870
foo one    1.439750  0.213128
    three  2.028818  0.149617
    two   -1.881011  0.038949

In [90]:
#Reshaping

In [92]:
#stack

In [93]:
In [91]: arrays = [
   ....:    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ....:    ["one", "two", "one", "two", "one", "two", "one", "two"],
   ....: ]
   ....: 

In [92]: index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [93]: df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [94]: df2 = df[:4]

In [95]: df2
Out[95]: 
                     A         B
first second                    
bar   one    -0.727965 -0.589346
      two     0.339969 -0.693205
baz   one    -0.339355  0.593616
      two     0.884345  1.591431

SyntaxError: invalid syntax (1454033587.py, line 14)